app/models/concerns/roles_update.rb

def add_user_role
    User.last.update(role: "student")
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "users" SET "roles" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["roles", "student"], ["updated_at", "2020-07-28 00:05:28.384544"], ["id", 5]]