app/views/pages/subjects.html.erb

SELECT "lessons".* FROM "lessons" ORDER BY "lessons"."id" ASC LIMIT ?  [["LIMIT", 1]]
---

<%= link_to "First Video", Lesson.first%>