app/views/lessons/_form.html.erb

    <label for="subject_id">Select Subject:</label>
    <%= form.collection_select :subject_id, Subject.all, :id, :title, prompt: true%>
---
SELECT "subjects".* FROM "subjects"