app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons" ORDER BY "lessons"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @lessons = Lesson.all