app/controllers/pages_controller.rb

  def subjects
    @lessons = Lesson.all
---
SELECT "lessons".* FROM "lessons" ORDER BY "lessons"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def portal
  	@queries = Query.all
---
SELECT "queries".* FROM "queries"