app/controllers/profiles_controller.rb

def update
 if @profile.update(profile_params)
---
UPDATE "profiles" SET "name" = ?, "surname" = ?, "slug" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["name", "Brandon Bwanakocha"], ["surname", ""], ["slug", "brandon-bwanakocha"], ["updated_at", "2020-08-08 07:23:19.618123"], ["id", 11]]

 def set_profile
   @profile = Profile.friendly.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]