app/controllers/queries_controller.rb

  def show
    @creator = Profile.find(@query.creator)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]