app/controllers/queries_controller.rb

DELETE FROM "queries" WHERE "queries"."id" = ?  [["id", 1]]
---
  def destroy
    @query.destroy

SELECT "queries".* FROM "queries" WHERE "queries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_query
      @query = Query.find(params[:id])