app/controllers/queries_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @creator = Profile.find(@query.creator)

UPDATE "queries" SET "profile_id" = ?, "updated_at" = ? WHERE "queries"."id" = ?  [["profile_id", 9], ["updated_at", "2020-08-08 07:31:55.336080"], ["id", 4]]
---
  def update_status
    if @query.active?
      @query.accepted!
      @query.update(profile_id: current_user.profile_id)

UPDATE "queries" SET "image" = ?, "updated_at" = ? WHERE "queries"."id" = ?  [["image", "hat.jpeg"], ["updated_at", "2020-08-08 07:42:51.159642"], ["id", 5]]
---
  def update
    if @query.update(query_params)

DELETE FROM "queries" WHERE "queries"."id" = ?  [["id", 1]]
---
  def destroy
    @query.destroy

SELECT "queries".* FROM "queries" WHERE "queries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_query
      @query = Query.find(params[:id])