app/controllers/users/registrations_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "users" SET "roles" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["roles", "tutor"], ["updated_at", "2020-07-21 19:24:41.296289"], ["id", 2]]
---
   def create
     super
     User.last.update(role: "student")